CF/InformationRegisters/ШаблоныРегистрацииНовыхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныРегистрацииНовыхКарт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроводитьОпросВладельцаПриРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаВладельцаКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлинаКода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоДиапазона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецДиапазона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/InformationRegisters/ШаблоныРегистрацииНовыхКарт/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПересечения(Команда)
	
	ПроверитьПересеченияСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПересеченияСервер()
	
	ТекстСообщения = НСтр("ru = 'Пересечения не обнаружены'"); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ВидКарты,
	|	ВложенныйЗапрос.ДлинаКода,
	|	ВложенныйЗапрос.НачалоДиапазона,
	|	ВложенныйЗапрос.КонецДиапазона,
	|	ВложенныйЗапрос.ПроводитьОпросВладельцаПриРегистрации,
	|	ВложенныйЗапрос.ВидДисконтнойКарты,
	|	ВложенныйЗапрос.БонуснаяПрограммаЛояльности,
	|	ВложенныйЗапрос.ГруппаКарты,
	|	ВложенныйЗапрос.НаименованиеШаблона
	|ИЗ
	|	(ВЫБРАТЬ
	|		ШаблоныРегистрацииНовыхКарт.ВидКарты КАК ВидКарты,
	|		ШаблоныРегистрацииНовыхКарт.ДлинаКода КАК ДлинаКода,
	|		ШаблоныРегистрацииНовыхКарт.НачалоДиапазона КАК НачалоДиапазона,
	|		ШаблоныРегистрацииНовыхКарт.КонецДиапазона КАК КонецДиапазона,
	|		ШаблоныРегистрацииНовыхКарт.ПроводитьОпросВладельцаПриРегистрации КАК ПроводитьОпросВладельцаПриРегистрации,
	|		ШаблоныРегистрацииНовыхКарт.ВидДисконтнойКарты КАК ВидДисконтнойКарты,
	|		ШаблоныРегистрацииНовыхКарт.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|		ШаблоныРегистрацииНовыхКарт.ГруппаКарты КАК ГруппаКарты,
	|		ВЫБОР
	|			КОГДА ШаблоныРегистрацииНовыхКарт.НачалоДиапазона < &НачалоДиапазона
	|					И ШаблоныРегистрацииНовыхКарт.КонецДиапазона < &НачалоДиапазона
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ШаблоныРегистрацииНовыхКарт.НачалоДиапазона > &КонецДиапазона
	|							И (ШаблоныРегистрацииНовыхКарт.КонецДиапазона > &КонецДиапазона
	|								И &КонецДиапазона <> &ПустойДиапазон)
	|						ТОГДА ЛОЖЬ
	|				КОГДА &КонецДиапазона <> &ПустойДиапазон
	|						И ШаблоныРегистрацииНовыхКарт.КонецДиапазона = &ПустойДиапазон
	|						И ШаблоныРегистрацииНовыхКарт.НачалоДиапазона > &КонецДиапазона
	|					ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОНЕЦ КАК Пересечение,
	|		ШаблоныРегистрацииНовыхКарт.НаименованиеШаблона КАК НаименованиеШаблона
	|	ИЗ
	|		РегистрСведений.ШаблоныРегистрацииНовыхКарт КАК ШаблоныРегистрацииНовыхКарт
	|	ГДЕ
	|		ШаблоныРегистрацииНовыхКарт.ДлинаКода = &ДлинаКода
	|		И (НЕ(ШаблоныРегистрацииНовыхКарт.НачалоДиапазона = &НачалоДиапазона
	|					И ШаблоныРегистрацииНовыхКарт.КонецДиапазона = &КонецДиапазона))
	|		И ШаблоныРегистрацииНовыхКарт.ВидКарты = &ВидКарты) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Пересечение";
	
	Запрос.УстановитьПараметр("ДлинаКода"      , Запись.ДлинаКода);
	Запрос.УстановитьПараметр("НачалоДиапазона", Запись.НачалоДиапазона);
	Запрос.УстановитьПараметр("КонецДиапазона" , Запись.КонецДиапазона);
	Запрос.УстановитьПараметр("ВидКарты"       , Запись.ВидКарты);
	Запрос.УстановитьПараметр("ПустойДиапазон" , "");
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Если Выборка.Количество() > 1 Тогда
			ТекстСообщения = НСтр("ru = 'Диапазон текущей записи пересекается с диапазонами:'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Диапазон текущей записи пересекается с диапазоном:'");
		КонецЕсли;
		Пока Выборка.Следующий() Цикл
			ТекстШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '- %1, Начало диапазона - %2, Конец диапазона - %3'"),
				Выборка.НаименованиеШаблона,
				Выборка.НачалоДиапазона,
				Выборка.КонецДиапазона);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстШаблона;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			Запись,
			"НачалоДиапазона");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводитьОпросВладельцаПриРегистрацииПриИзменении(Элемент)
	УстановитьДоступностьВладельца();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьВладельца()
	Элементы.ГруппаВладельцаКарты.Доступность = Запись.ПроводитьОпросВладельцаПриРегистрации;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьВладельца();
КонецПроцедуры

#КонецОбласти
